# Задание 1: создать словарь из двух списков

lst1 = ['red', 'green', 'blue']
lst2 = ['#FF0000', '#080000', '0000FF']
d = dict(zip(lst1, lst2))
print(d)
