# Задание 1: посчитать все гласные буквы

vowels = {'у', 'ё', 'е', 'ы', 'а', 'о', 'э', 'я', 'и', 'ю', 'У', 'Ё', 'Е', 'Ы', 'А', 'О', 'Э', 'Я', 'Ю'}

line = list(input('Введите строку: '))

counter = 0
for el in line:
    if el in vowels:
        counter += 1

print('Количество гласных букв в строке:', counter)
