# Создать lambda выражение , которое суммирует три числа.

sum3 = (lambda x, y, z: x + y + z)

print(sum3(2, 4, 6))
